[
  {
    "id": "4etsZuSUBrolvUC8wxrgF9",
    "title": "Eggs Benedict Decadence",
    "description": "Dive into the world of velvety poached eggs draped in a luxuriously creamy hollandaise sauce, all perched atop a lightly toasted English muffin that crisps with each bite. As the yolk breaks, it merges with the sauce, creating an indulgent, buttery river that promises a taste of breakfast heaven. Garnished with a sliver of smoky Canadian bacon, this dish is the epitome of morning elegance.\n\nIngredients:\n\nFresh large eggs\nEnglish muffins\nCanadian bacon (or ham)\nButter\nFresh lemon juice\nWhite wine vinegar (for poaching)\nCayenne pepper\nSalt\nFresh parsley (for garnish, optional)\nDive in and let every bite transport you to a gourmet paradise!\n",
    "img": "//images.ctfassets.net/zi6lefd4slos/2ttnuR6peA4vVhnQpfHlH5/f68d8b733eb7c845c4c30bcc82c5414d/tumblr_371bcbaa62cae3f0123ce372c233f571_374373b7_540.gif"
  },
  {
    "id": "3f7Fo8XV31prRzgGd2Tz2h",
    "title": "Fried Polenta Panzanella Feast",
    "description": "Season and drain the tomatoes:\nPlace a colander in a large bowl, then add tomatoes to the colander and toss with 1 tablespoon of kosher salt. Set aside at room temperature to allow the tomatoes to drain, stirring every 10 minutes, for 30 minutes total.\n\nPrep the polenta:\nStore bought polenta usually comes in tubes. For attractive rectangles, trim the edges to square the polenta off before slicing into 1-inch rectangles. Discard the scraps.\nFry the polenta:\nMeanwhile, fry the polenta. In a large skillet over medium heat, warm 4 tablespoons of olive oil. In batches, sear the polenta until golden brown on all sides and tender in the center, about 6 minutes total. Transfer to a paper towel lined plate and sprinkle lightly with kosher salt, to taste. Set aside to cool.\n\nMake the dressing:\nRemove the colander from the bowl and set it in the sink. \n\nKeep the accumulated tomato juices in the bowl. Add the shallot, garlic, mustard, and balsamic. Allow to sit for 5 minutes. Then, slowly pour in the remaining 1/2 cup olive oil while whisking constantly. Season to taste with kosher salt and pepper.\n\nMix the panzanella: \nRight before serving, add the tomatoes, polenta, and torn basil into the bowl with the dressing. Toss to combine.\n\nTransfer to a serving platter, top with burrata, and serve: \nUse a large spoon to transfer to a serving platter. There will be residual liquid, dress as desired. Top panzanella with burrata. Drizzle with 2 tablespoons olive oil and season with flaky salt and a few grinds of freshly cracked black pepper. \n\nGarnish with whole basil leaves. Serve.",
    "img": "//images.ctfassets.net/zi6lefd4slos/7kkrAjEiJvToJmGg4BPvxd/25195e7c0a67b4c5edcfb1e987542b41/Simply-Recipes-Gaby-Fried-Polenta-Panzanella-LEAD-04-e909f61d21dc41948d58cd59d6b9d068.webp"
  },
  {
    "id": "6OjLPIpV016zyHQqGa7Bhz",
    "title": "Avocado Toasts Special",
    "description": "Method to cook:\n\nCook the corn topping:\nIn a small skillet over high heat, heat the oil. Add the corn and cook, stirring often, for 3 to 4 minutes, or until the corn starts to develop some brown spots.\n\nAdd the scallions and cook for 1 minute. Stir in the olives and salt and pepper to taste.\n\nToast the bread:\nIn a toaster, toast the bread until golden brown, or to the desired doneness.\n\nAdd the toppings:\nTop each piece of toast with slices of avocado (left in slices or mashed with a fork), then sprinkle with salt and pepper.\n\nSqueeze a lime wedge over each avocado toast. Top with the corn and olive mixture, followed by the crumbled queso fresco. Sprinkle with cilantro and pumpkin seeds.\n\nServe:\nServe immediately.",
    "img": "//images.ctfassets.net/zi6lefd4slos/6nrCIGEiIEBgqEncYoasG8/44f9210e825d6c5a0eaf8b16d55b6f3d/Mexican-Avocado-Toast.webp"
  },
  {
    "id": "74hpfdpyl597nW0jTMe8e8",
    "title": "Banana Maple Dream",
    "description": "1 3/4 cups (236g) all-purpose flour\n1 teaspoon baking powder\n1/2 teaspoon baking soda\n1/2 teaspoon kosher salt\n3/4 cup (150g) granulated sugar\n6 tablespoons (84g) unsalted butter, melted\n3 tablespoons neutral oil, such as canola or vegetable\n1 large egg, at room temperature\n1 1/4 teaspoons vanilla extract\n3/4 cup well-mashed overripe banana (about 2 medium bananas)\n3/4 cup low-fat buttermilk, at room temperature\n185 g mini semi-sweet chocolate chips, divided",
    "img": "//images.ctfassets.net/zi6lefd4slos/3eNs2De4pNqrUm7ou9q7Fq/64005ecffd60aeb5769da9e43be644c5/giphy.gif"
  },
  {
    "id": "6lLe1DjRIrPaVuUCiXVEEC",
    "title": "Meatballs Masterpiece",
    "description": "Succumb to the allure of exquisitely seasoned meatballs, lovingly hand-rolled and seared to a golden perfection. As they simmer, these tender orbs of delight become infused with a rich, aromatic sauce that's a harmonious blend of tangy tomatoes, fragrant herbs, and a hint of red wine. Every bite promises a burst of savory richness, transporting your senses straight to an old-world Italian trattoria.\n\nIngredients:\n\nGround beef (or a mix of beef and pork)\nFresh breadcrumbs\nGrated Parmesan cheese\nGarlic cloves, minced\nFresh basil and parsley, finely chopped\nEggs\nSalt and black pepper\nCanned crushed tomatoes\nRed wine (optional)\nOlive oil\nRed pepper flakes (for a touch of heat)\nFresh mozzarella or ricotta cheese (for garnish, optional)\nIndulge and let the symphony of flavors play on your palate, reminding you of the timeless art of Italian cooking!",
    "img": "//images.ctfassets.net/zi6lefd4slos/70GjmG3G0IjakESX3uajlO/9f520c4a74e36a18882b2eeb3a6ae8c9/tumblr_a973f09c0cfa4a47555b3f8527597e2c_81931e81_540.gif"
  },
  {
    "id": "3LDFiJCbSeow5qmUp64pLD",
    "title": "Classic Chicken Provencal",
    "description": "Method to cook dish:'\n\nPreheat the oven:\nPreheat the oven to 400°F.\n\nSeason and sauté the chicken:\nSeason the chicken thighs well on all side with salt and pepper.\n\nIn a large (at least 12-inch) oven-safe skillet or Dutch oven over medium-low heat, add olive oil. Add chicken thighs into the skillet, skin side down. Cook, untouched, for 8-10 minutes so skin can start to render and brown slowly.\n\nWhile your chicken thighs start to brown, prepare the other ingredients.\nFlip chicken and add remaining ingredients:\nWhen chicken thighs have browned on one side, flip the chicken thighs. It can be helpful to use a thin spatula to make sure to get the skin loose from the skillet. Sprinkle chicken thighs with Herbs de Provence, shallots, garlic, cherry tomatoes, green olives, lemon wedges, capers, and thyme sprigs. Add the white wine to the skillet, around the chicken pieces.\n\nBraise chicken in oven:\nPlace skillet in the oven and braise, uncovered, for one hour. The chicken is done when opaque all the way through and the thighs register at least 165°F in the middle.\n\nRemove braise from oven, let cool, then serve:\nRemove and let cool for five minutes and then serve over rice or with a crusty baguette.\n",
    "img": "//images.ctfassets.net/zi6lefd4slos/11nSDkDsdxkRMjL0njp1WA/3196029fba452f42a0e327a1146484af/Chicken-Provencal.webp"
  },
  {
    "id": "2Po1UPAa6QaCAzwTUOPOzY",
    "title": "Antipasto Salad",
    "description": "Method to prepare the reciepe:\n\nPreheat the oven to 400°F.\nMake the croutons:\nPile the bread in the center of a large rimmed baking sheet. Drizzle with the oil, sprinkle with salt, and toss to coat. \n\nSpread the bread out and bake just until beginning to brown, about 5 minutes. Remove from oven and set aside.\nBite Sized Baguette Pieces on a Baking Pan for Antipasto Salad Recipe\n\nBaked Baguette Pieces on a Baking Pan for Croutons Recipe\n\nAssemble the salad:\nPut the lettuce into a large salad bowl. Arrange the tomatoes, artichoke hearts, chickpeas, mozzarella balls, sweet cherry peppers, pepperoncini, salami, and olives in piles in a pinwheel on top of the greens.\n\nAntipasto Salad Ingredients in Separate Piles in a Bowl \nMake the dressing:\nPlace the anchovies on a cutting board and use the back side of a fork to smash them into a purée. Scoop into a glass jar with a lid along with the olive oil, vinegar, Dijon, oregano, garlic powder, and salt. \n\nScrew on the lid and shake vigorously to blend.\n\nAnchovies Mashed on a Wooden Cutting Board Using a Fork for Antipasto Salad Recipe\n\nJar of Dressing Ingredients Next to Bowl of Antipasto Salad Ingredients and a Baking Pan With Croutons\n\nAntipasto Salad Salad Dressing in an Opened Jar After Shaken\n\nDress the salad:\nAdd the croutons to the salad. Drizzle about half the dressing over the top and toss well. Taste and add more dressing as needed. Taste again and add salt, if desired. Divide the salad onto plates or bowls. Shower each serving with finely grated Parmesan cheese. \n\nStore leftovers in a covered container in the fridge. Undressed salad will keep for up to 3 days. Once dressed, it will hold up reasonably well overnight. ",
    "img": "//images.ctfassets.net/zi6lefd4slos/5GNSLw4p0zUfEIFrBQBDRd/e6ca1ce247b673ed87537554f394dbc4/Antipasto-Salad.webp"
  },
  {
    "id": "4O91wvvbltvuq4TKnAt3EL",
    "title": "Shakshuka with Feta, Olives, and Peppers",
    "description": "Cooking Method:\nCook the onion and peppers:\nIn a large skillet over medium heat, heat the oil. Add the paprika, cumin, and pepper flakes and cook for 30 seconds to a minute to bloom the spices.\n\nAdd the onion and cook, stirring occasionally, for 3 minutes. Add the garlic, red pepper, and yellow pepper and cook, stirring occasionally, for 15 minutes, or until the vegetables soften.\n\nCrush the tomatoes and simmer them with the peppers:\nIn a bowl, break up the tomatoes with your hands. Add them to the skillet with the salt and cook for 5 minutes. Taste and add more salt, if you prefer.\n\nCook the eggs:\nWith the back of a spoon or a ladle, make 4 indentations in the sauce.\n\nBreak an egg into a cup and carefully pour it into and indentation, being careful not to break the yolk. Repeat with the remaining eggs. (You can crack the egg directly into the sauce and skip the cup, but it’s easier to get a an errant egg shell or protect the dish from a bad egg if you use the cup method.)\n\nSprinkle the feta and olives around the eggs. Cover the pan and simmer over medium heat for 8 minutes, or until the whites are set and the yolks are still soft. (If you like your eggs well done, cook for a minute or two longer.)\n\nTo serve:\nGarnish with cilantro leaves and a sprinkling of red pepper flakes. Bring to the table and serve from the pan.",
    "img": "//images.ctfassets.net/zi6lefd4slos/eoqFkX1lAA7pQm9viOIPC/f2e00bca7af7f9322959e2361c2cd13a/Shakshuka-Feta-Olives-LEAD-7-e2bc42ab0deb406d9828fbeb9fdf4ef6.webp"
  },
  {
    "id": "6pmJyg1qsHdlQFW4MLbgF9",
    "title": "Cream Cheese Zucchini Muffins",
    "description": "Baking with Zucchini\nZucchini has a mild, sweet flavor and adds a lot of moisture to baked goods. Many recipes even call for squeezing water out of the grated zucchini. For these muffins, I skipped this step and didn't squeeze any of the water out. This muffin batter is slightly thicker than standard muffins and can handle the extra moisture.\n\nI used regular grocery store zucchini. If you’re lucky enough to have zucchini fresh from the garden, use the smaller ones for this recipe, since big zucchini can be watery. To grate the zucchini, use the coarse holes on a box grater or use the grater attachment of a food processor.\n",
    "img": "//images.ctfassets.net/zi6lefd4slos/0YySvPeRuuBu1FWTeSfpB/f2eb64eef33879074825d09951c856c5/Simply-Recipes-Cream-Cheese-Zucchini-Muffins-LEAD-2-a32c8819c44b439cb6f28a8c55bf5150.webp"
  },
  {
    "id": "2u0twWa38OFAvals4OPzuY",
    "title": "Chocolate Banana Bread",
    "description": "Bake a loaf of tender, chocolatey chocolate banana bread! Double chocolate with cocoa and chocolate chips, it's sure to vanish.",
    "img": "//images.ctfassets.net/zi6lefd4slos/1Jlsf40elomkUSd4NLrGFE/1c9e64e933bcd23d41b4aa7c991d7b2e/Simply-Recipes-Chocolate-Banana-Bread-LEAD-20-ba3188cee1d04e099962af7f78deaaa9.webp"
  }
]
